1s/ERP/Conf/Documents/Лико_КонтрольСроковГодностиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_КонтрольСроковГодностиНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_СрокиГодностиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РассылкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодностиАдминистративный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУведомления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиАдминистративный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Площадки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СрокиГодностиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СрокиГодностиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГодностиАдминистративный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_КонтрольСроковГодностиНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура РассылкаВыполнена(Рассылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_КонтрольСроковГодностиНоменклатуры.Ссылка КАК Ссылка,
	|	Лико_КонтрольСроковГодностиНоменклатуры.Дата КАК Дата
	|ИЗ
	|	Документ.Лико_КонтрольСроковГодностиНоменклатуры КАК Лико_КонтрольСроковГодностиНоменклатуры
	|ГДЕ
	|	Лико_КонтрольСроковГодностиНоменклатуры.Проведен
	|	И Лико_КонтрольСроковГодностиНоменклатуры.Рассылка = &Рассылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Рассылка",Рассылка );
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Период = КонецДня(ТекущаяДата());
	
		Пока Выборка.Следующий() Цикл
		
		Площадки = Выборка.Ссылка.Площадки.ВыгрузитьКолонку("Площадка");

		ОтметитьУведомлениеУОбъектовНоменклатуры(Период, Площадки);
	
	КонецЦикла; 
	

КонецПроцедуры 



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтметитьУведомлениеУОбъектовНоменклатуры(Период, Площадки) //+--->Лико m.shenderov 20.08.2025
	
МассивОбъектов = НеотмеченныеОбъекты(Период, Площадки);

Для каждого ОбъектНоменклатуры Из МассивОбъектов Цикл 
	
	СпрОбъект =  ОбъектНоменклатуры.ПолучитьОбъект();
	СпрОбъект.УведомлениеОтправлено = ТекущаяДата();
	СпрОбъект.Записать();
	
	
КонецЦикла;
	
	
	
КонецПроцедуры //-<---Лико m.shenderov 20.08.2025



Функция НеотмеченныеОбъекты(Период, Площадки) //+Лико m.shenderov 20.08.2025
	
	
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокУведомления КАК СрокУведомления,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодности КАК СрокГодности,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Площадка КАК Площадка,
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.СрокГодностиАдминистративный КАК СрокГодностиАдминистративный
|ПОМЕСТИТЬ ВтНоменклатура
|ИЗ
|	РегистрСведений.Лико_СрокиГодностиНоменклатуры.СрезПоследних(, ) КАК Лико_СрокиГодностиНоменклатурыСрезПоследних
|ГДЕ
|	Лико_СрокиГодностиНоменклатурыСрезПоследних.Площадка В(&Площадки)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТоварыВЯчейкахОстатки.Ячейка.Лико_Площадка КАК Площадка,
|	ТоварыВЯчейкахОстатки.Ячейка.Владелец КАК Склад,
|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Остаток,
|	ВтНоменклатура.СрокГодности КАК СрокГодности,
|	ВтНоменклатура.СрокУведомления КАК СрокУведомления,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства КАК ДатаПроизводства,
|	ВтНоменклатура.СрокГодностиАдминистративный КАК СрокГодностиАдминистративный,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо КАК УпотребитьДо,
|	ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства, ДЕНЬ, ВтНоменклатура.СрокГодностиАдминистративный - ВтНоменклатура.СрокУведомления) КАК ДатаУведомления,
|	&ТекущаяДата КАК ТекущаяДата,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
|	ВЫБОР
|		КОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства = ДАТАВРЕМЯ(1, 1, 1)
|			ТОГДА ВЫБОР
|					КОГДА ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1)
|						ТОГДА ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо, ДЕНЬ, -ВтНоменклатура.СрокГодности)
|					ИНАЧЕ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства
|				КОНЕЦ
|		ИНАЧЕ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства
|	КОНЕЦ КАК ДатаПроизводстваРасчетная
|ПОМЕСТИТЬ ВременнаяТаблица
|ИЗ
|	РегистрНакопления.ТоварыВЯчейках.Остатки(, ) КАК ТоварыВЯчейкахОстатки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНоменклатура КАК ВтНоменклатура
|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ВтНоменклатура.Номенклатура
|			И ТоварыВЯчейкахОстатки.Ячейка.Лико_Площадка = ВтНоменклатура.Площадка
|ГДЕ
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный
|	И (ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства <> ДАТАВРЕМЯ(1, 1, 1)
|			ИЛИ ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо <> ДАТАВРЕМЯ(1, 1, 1))
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВременнаяТаблица.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
|	ВременнаяТаблица.ОбъектНоменклатуры.УведомлениеОтправлено КАК УведомлениеОтправлено,
|	ДОБАВИТЬКДАТЕ(ВременнаяТаблица.ДатаПроизводстваРасчетная, ДЕНЬ, ВременнаяТаблица.СрокГодностиАдминистративный - ВременнаяТаблица.СрокУведомления) КАК ДатаУведомления
|ИЗ
|	ВременнаяТаблица КАК ВременнаяТаблица
|ГДЕ
|	ДОБАВИТЬКДАТЕ(ВременнаяТаблица.ДатаПроизводстваРасчетная, ДЕНЬ, ВременнаяТаблица.СрокГодностиАдминистративный - ВременнаяТаблица.СрокУведомления) <= ВременнаяТаблица.ТекущаяДата
|	И ВременнаяТаблица.ОбъектНоменклатуры.УведомлениеОтправлено = ДАТАВРЕМЯ(1, 1, 1)
|	И ВременнаяТаблица.ДатаПроизводстваРасчетная <> ДАТАВРЕМЯ(1, 1, 1)
|
|УПОРЯДОЧИТЬ ПО
|	ДатаУведомления";
Запрос.УстановитьПараметр("Площадки",Площадки);
Запрос.УстановитьПараметр("ТекущаяДата",Период);

РезультатЗапроса = Запрос.Выполнить();

Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектНоменклатуры");

	
	
КонецФункции //-Лико m.shenderov 20.08.2025 




#КонецОбласти

#КонецЕсли
